f%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%  BURS - исходный код алгоритма 1.0                                %
%  Подготовлен в MATLAB 2015                                        %
%  Разработчик: Василий Мохов                                       %
%         email: mokhov_v@mail.ru                                   %
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

% Main source code :
% ======================================================== % 
% Алгоритм вычисления целевой функции                      %
% Алгоритм пока не опубликован и не описан нигде.          %
% ======================================================== %   

function [o, f1, f2, f3] = Calc_Fitness(S, T, K)
        % ---- ВХОДЫ --------------------------------------------------------------
        %  S - вектор действующих значений токов по фазам L1, L2, L3
        %  T - вектор значений гармонических искажений по фазам
        %  K - количество ОП для переключения между фазами
        % ---- ВЫХОДЫ -------------------------------------------------------------
        %      o - абсолютное значение функции цели 
        %     f1 - значение критерия неравномерности распределения токов по фазам
        %     f2 - значение критерия гармонических искажений на фазах
        %     f3 - значение критерия, определющего процент переключамых ОП
        % -------------------------------------------------------------------------
        global StartTHD;           % значения THD по фазам для исходной комбинации
        global col_OP;             % общее количество ОП
        
        %% Вычисляем значение 1-го критерия
        %       f1 = (S(1)^2 + S(2)^2 + S(3)^2)/(3*((S(1)+S(2)+S(3))^2));
                f1 = (S(1)^2 + S(2)^2 + S(3)^2)/(((S(1)+S(2)+S(3))^2));
        
        %% Вычисляем значение 2-го критерия
              % без балансировки по фазам с корректировкой диапазона 0 ... 0.33
              % 300:2700 = 0.11(1),  sqrt(0.11(1)) = 0.3333
        %       f2 = sqrt((T(1) + T(2) + T(3))/2700);
                f2 = sqrt((T(1) + T(2) + T(3))/900);
              
        %       % с балансировкой по фазам
        %       f2 = (T(1)^2 + T(2)^2 + T(3)^2)/(3*((T(1)+T(2)+T(3))^2));
        
        %       % оносительно исходных значений THD без балансировки по фазам 
        %       % с "отсечением" по верхнему ограничению 
        %       f2 = (T(1)/StartTHD(1) + T(2)/StartTHD(2) + T(3)/StartTHD(3))/9;
        %       if f2 > (1/3), f2 = (1/3); end;    
        
        %% Вычисляем значение 3-го критерия
        %        f3 = K/(3*col_OP); % сразу относительное значение по количеству пользователей
                 f3 = K/(col_OP);
        %          f3 = 0.3;
               
        %% Проверка и эхо печати
        % % %        if f2 > 1/3, disp(['   ---   f2 БОЛЬШЕ 0,33!!! f2 = ',num2str(T)]); end
        %        disp(['f1 = ',num2str(f1),' f2 = ',num2str(f2), ' f3 = ',num2str(f3)]);
        
        %% Вычисляем взвешенные элементы и значение целевой функции
               f1 = f1*0.7;      f2 = f2*0.2;       f3 = f3*0.1;
               
               o = f1 + f2 + f3;
        %        disp(o);
        
        end
        
        