%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% Функция вычисления THD по Костинскому:                              %
% Osc - вектор точек осциллограммы                                    %
% TrueRMSI - действующее значение тока                                %
% ProcTHD - процент суммарного гармонического искажения               %
% Am - вектор амплитуд гармоник полученный после преобразования Фурье %
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
function [ TrueRMSI, ProcTHD, Am ] = Calc_DznI_THD(OscS)

  N = length(OscS);   % количество точек в осциллограмме сигнала
  Osc = reshape(OscS(1,:),[N,1]);
  
  %% Вычисление действующего значения тока
  TrueRMSI = sqrt(sum(((OscS.^2)*0.02/(N-1)))/0.02);
  
  % % Расчет амплитуды гармоник
  S = zeros(N,11);
  C = zeros(N,11);
  for i=1:N
      for k=1:11 %50 
        S(i,k) = sin((2*pi*i*k)/N);
        C(i,k) = cos((2*pi*i*k)/N);
        k = k + 1;
      end
  end
  % заменил массивом констант вместо расчета (как в цикле выше)

  A = zeros(11,1);
  B = zeros(11,1);
  Am = zeros(11,1);
  for k=1:11 %50
      A(k)=(2/N)*sum(Osc.*S(:,k));
      B(k)=(2/N)*sum(Osc.*C(:,k));
      Am(k)=sqrt(A(k)^2+B(k)^2)/sqrt(2);
    % k = k + 1;
  end
  
  %% Вычисление THD по формуле от Костинского
  Sq = sqrt(sum(Am(2:end).^2));
  ProcTHD = 100*(Sq)/Am(1);
  end